/*
Создать sql-скрипт для заполнения базы данных записями (минимум 3 записи на таблицу)
*/

USE Hospital;

INSERT INTO doctor VALUES
  (0, 'Доктор 1', 'Хирургия'),
  (1, 'Доктор 2', 'Неврология'),
  (2, 'Доктор 3', 'Рентгенология');

INSERT INTO room VALUES
  (0, 329, 3, 'Хирургия', 1, DATE(CURDATE() - 15), 0),
  (1, 13, 2, 'Неврология', 2, DATE(CURDATE() - 1), 1),
  (2, 229, 1, 'Рентгенология', 0, DATE(CURDATE() - 7), 0),
  (3, 14, 10, 'Неврология', 0, DATE(CURDATE() - 1), 1);

INSERT INTO patient VALUES
  (0, 'Пациент 1', 0, '88 000 11', DATE(CURDATE() - 15), 0, 0, 'Болеет', NULL),
  (1, 'Пациент 2', 1, '92 040 11', DATE(CURDATE() - 1), 1, 1, 'Тяжелый случай', NULL),
  (2, 'Пациент 3', 1, '84 111 44', DATE(CURDATE() - 18), 1, 1, 'Дай бог выживет', NULL),
  (3, 'Пациент 4', 0, '34 123 00', DATE(CURDATE() - 7), 2, 2, 'Вроде норм', DATE(CURDATE() - 7));
